       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      * *******************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = GABRIELA GABPI0
      * OBJETIVO: MOSTRAR A STRING HELLO ALURA
      * DATA: = 02/01/2020
      **********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "HELLO ALURA".
           STOP RUN.
